#include <stdio.h>
#include <stdlib.h>

int main() {

    /*
     * & 位与
     * | 位或
     * ~ 位反
     * ^ 异或
     * >> 右移
     * << 左移
     * */
    int a = 0b10;
    int b = 0b10;
    //位与运算,对应位只要其中一个为0,则为0
    printf("%d&%d=%d\n", a, b, a & b);
    //位或运算,对应位只要其中一个为1,则为1
    printf("%d&%d=%d\n", a, b, a | b);
    //位反运算
    uint8_t c = 2;//0b00000001,求反则是0b11111110
    printf("~%d", c);
    c = ~c;
    printf("=%d\n", c);
    int8_t d = 2;//-128...-3,-2,-1,0,1,2,3...127
    printf("~%d", d);
    d = ~d;
    printf("=%d\n", d);

    //异或运算,0b10^0b01=ob11,对应位不同则为1,相同则为0
    printf("%d^%d=%d\n", a, b, a ^ b);
    //左移运算,左移1位乘以2
    //8=0b1000,右移两位为0b100000
    printf("8<<2=%d\n", 8 << 2);
    //右移运算,右移1位除以2
    //8=0b1000,右移两位为0b10
    printf("8>>2=%d\n", 8 >> 2);
    return 0;
}